// Задание 3.
// Реализовать простой калькулятор (операции + - / * )
// Пример работы программы:
// Введите число 1: 2
// Введите число 2: 3
// Введите операцию: +
// Ответ: 5
// Введите число 1: 2
// Введите число 2: 3
// Введите операцию: а
// Ответ: Такой операции нет

import java.util.Scanner;

public class task3 {
    public static void main(String[] args) throws Exception {
        Scanner iScanner = new Scanner(System.in);
        System.out.printf("Введите число 1: ");
        int a = iScanner.nextInt();
        System.out.println(n);
}
